/* Задача.
Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых
меньше лиибо равна 3 символа. Первоначальный массив можно ввести с клавиатуры или задать на старте.
При решении не рекомендуется пользоваться коллекциями.

Примеры:
["hello", "2", "world", ":-)"] -> ["2", ":-)"]
["1234", "1567", "-2", "computer science"] -> ["-2"]
["Russia", "Denmark", "Kazan"] -> []
*/

string [] array1 = {"hello", "2", "world", ":-)"};
string [] array2 = {"1234", "1567", "-2", "computer science"};
string [] array3 = {"Russia", "Denmark", "Kazan"};

int maxLength = 3;



